tap "cloudquery/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "stripe/stripe-cli"
tap "thoughtbot/formulae"

brew "awscli"
brew "bat"
brew "chruby"
brew "cloudquery"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "jq"
brew "kubernetes-cli"
brew "libpq"
brew "mise"
brew "mysql-client"
brew "neovim"
brew "node"
brew "openssl"
brew "postgresql@16"
brew "rcm"
brew "redis"
brew "ripgrep"
brew "ruby-install"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "tmux"
brew "tree"
brew "vips"
brew "wget"
brew "yarn"
brew "zstd"

cask "aws-vault"
cask "ghostty"
cask "google-chrome"
cask "firefox"
cask "font-inconsolata-g"
cask "font-monaspace"
cask "iterm2"
cask "libreoffice"
cask "ngrok"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "visual-studio-code"

vscode "kaiwood.endwise"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-vsliveshare.vsliveshare"
vscode "Shopify.ruby-lsp"
vscode "sianglim.slim"
