tap "hashicorp/tap"

brew "aws-vault"
brew "awscli"
brew "docker"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gum"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "markdownlint-cli"
brew "mise"
brew "mysql-client"
brew "neovim"
brew "node"
brew "openssl"
brew "pgvector"
brew "postgresql@16"
brew "postgresql@18"
brew "redis"
brew "ripgrep"
brew "starship"
brew "tesseract"
brew "tree"
brew "vips"
brew "wget"
brew "yarn"
brew "yazi"
brew "zsh-autosuggestions"

cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "firefox"
cask "font-jetbrains-mono"
cask "libreoffice"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "yubico-authenticator"
